Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This is a debug only function and in general it should not be used unless indicated by a member of the YoYo Games Support staff, as indiscriminate use will cause serious performance issues with your game.
zh_cn: 这是一个调试功能，一般情况下，除非YoYo Games Support人员指示，否则不应该使用它，因为任意使用会导致你的游戏出现严重的性能问题。

source: This is a graphics (sprite) asset track.
zh_cn: 这是一个图像(精灵)资源轨道。

source: This is a legacy function that can be used to save the current state of the game, and is not recommended for use anymore.
zh_cn: 这是一个遗留功能，可以用来保存游戏的当前状态，不建议再使用。

source: This is a permanent removal, and changing rooms, or restarting the game will not bring the removed font back.
zh_cn: 这是一个永久删除，改变房间，或重新启动游戏将不会恢复被删除的字体。

source: This is a positive value from 0 - 65,535.
zh_cn: 这是0到65,535之间的一个正数值。

source: This is a positive value from 0 to 255.
zh_cn: 这是一个从0到255的正值。

source: This is a positive value from 0 to 4,294,967,295.
zh_cn: 这是一个从0到4294967295的正数值。

source: This is a purely visual option and when set to false you will not be able to see the particles as they are not drawn, but they still exists and are changing position, colour etc... as they would normally.
zh_cn: 这是一个纯粹的视觉选项，当设置为 false 时，您将无法看到粒子，因为它们没有被绘制，但它们仍然存在并且正在改变位置、颜色等......像往常一样。

source: This is a real number value parameter track.
zh_cn: 这是一个实数值参数轨道。

source: This is a scalar value from 0 to 1 that is used to scale the volume of all audio tracks in the sequence.
zh_cn: 这是一个从0到1的标量值，用于缩放序列中所有音频轨道的音量。

source: This is a scalar value, so 1 is a scale of 1:1, while setting it to 2, for example, will be double the scale and setting it to 0.5 would be halving the scale.
zh_cn: 这是一个标量值，因此1是1:1的比例，例如，将其设置为2将是比例的两倍，而将其设置为0.5将是比例的一半。

source: This is a sequence asset track.
zh_cn: 这是一个序列资源轨道。

source: This is a special grow buffer created by GameMaker which is pre-formatted for use when building primitives (for use with shaders, for example).
zh_cn: 这是由GameMaker创建的一个特殊的增长缓冲区，它是预先格式化的，以便在构建图元时使用(例如与着色器一起使用)。

source: This is a special grow buffer created by GameMaker which is pre-formatted for use when building primitives for use with shaders.
zh_cn: 这是由GameMaker创建的一个特殊的增长缓冲区，它是预先格式化的，以便在构建与着色器一起使用的图元时使用。

source: This is a text track.
zh_cn: 这是一个文本轨道。

source: This is a variant of the game_save() function, so please read its page first as it contains important information related to its use and to this function's as well.
zh_cn: 这是game_save()函数的一个变种，所以请先阅读它的页面，因为它包含了与它的使用以及此函数的使用相关的重要信息。

source: This is a very important function for those moments when you need to create and change sprites from external sources (like loading a sprite from a file with sprite_add(), or duplicating a sprite using sprite_duplicate()) and should always be used to remove those assets that are no longer needed by a game, or to clear an indexed asset from a variable before re-assigning another asset to that variable.
zh_cn: 这是一个非常重要的功能，当您需要从外部来源创建和更改精灵时(如使用sprite_add()从文件中加载精灵，或使用sprite_duplicate()复制精灵)，并且应该总是用于删除游戏不再需要的资源，或在将另一个资源重新分配给变量之前从变量中清除索引资源。

source: This is achieved in GameMaker by using the read only variable delta_time every step as it measures the time that has passed between one step and the next in microseconds (1microsecond is 1,000,000th of a second).
zh_cn: 这在GameMaker中是通过使用每个步骤的只读变量delta_time来实现的，因为它以微秒为单位衡量一个步骤和下一个步骤之间所经过的时间(1微秒是1,000,000分之一秒)。

source: This is an RGB value (no alpha component), and will clear the gif to this colour before anything is added to it.
zh_cn: 这是一个RGB值(没有alpha组件)，在添加任何东西之前将gif清除为这种颜色。

source: This is an alternative method to getting the alarm array value directly.
zh_cn: 这是直接获取告警数组值的另一种方法。

source: This is an alternative method to setting the alarm array directly.
zh_cn: 这是直接设置告警阵列的另一种方法。

source: This is an asynchronous function, and as such GameMaker does not block the device it is being run on while waiting for an answer, but rather keeps on running events as normal.
zh_cn: 这是一个异步函数，因此GameMaker在等待响应时不会阻塞正在运行的设备，而是像正常一样运行事件。

source: This is an audio asset track.
zh_cn: 这是一个音频资源轨道。

source: This is an event/moment track.
zh_cn: 这是一个事件/时刻轨道。

source: This is an instance asset track.
zh_cn: 这是一个实例资源轨道。

source: This is applied to all sub-images of the sprite.
zh_cn: 这适用于精灵的所有子图像。

source: This is applied to one single given sub-image of the sprite.
zh_cn: 这适用于精灵的单个给定子图像。

source: This is a built-in variable that is part of the instance variables created for every object instance in your game.
zh_cn: 这是一个内置变量，是为游戏中每个对象实例创建的实例变量的一部分。

source: This is because GameMaker pools memory resources to prevent memory allocation overhead, and so the memory will remain allocated until required for something else or re-used for a new stream.
zh_cn: 这是因为GameMaker将内存资源池化，以防止内存分配开销，因此内存将保持分配，直到需要其他内容或重新用于新流。

source: This is because GameMaker will draw the application surface without alpha blending when the automatic drawing is on.
zh_cn: 这是因为当自动绘制打开时，GameMaker将绘制没有alpha混合的应用程序表面。

source: This is because the font itself is not actually included with your game (for legal reasons) but an image of the font is included on a texture page and that is what your game will use (just like any other graphics asset).
zh_cn: 这是因为字体本身并不包含在你的游戏中(因为法律原因)，但字体的图像却包含在纹理页面中，这是你的游戏将使用的内容(就像其他图像资源一样)。

source: This is because when you create the list, internally the first few entries in the list are set to 0 to minimize performance issues when initially adding items to the list (although the ds_list_size() function will still return 0 on a newly created list).
zh_cn: 这是因为当您创建列表时，在内部列表中的前几个条目被设置为0，以最小化最初向列表中添加项目时的性能问题(尽管ds_list_size()函数在新创建的列表中仍将返回0)。

source: This is calculated automatically based on the density, inertia and mass of the instance as defined by the appropriate functions
zh_cn: 这是根据适当函数定义的实例的密度、惯性和质量自动计算的

source: This is calculated using the physics world coordinates ( not the GameMaker room coordinates) in radians.
zh_cn: 这是使用物理世界坐标(而不是GameMaker房间坐标)以弧度计算的。

source: This is essentially the same as running the game for the first time and so the Game Start Event will be triggered, as well as the Game End Event.
zh_cn: 这与第一次运行游戏基本相同，因此游戏开始事件和游戏结束事件都会被触发。

source: This is handy for preventing people from entering unwanted characters into a text entry (like entering "#" to force a new line).
zh_cn: 这可以方便地防止人们在文本条目中输入不需要的字符(比如输入"#"强制换行)。

source: This is ideal for those games that have aspect ratio correction set in the global Game Settings.
zh_cn: 这对于那些在全局游戏设置中设置了纵横比校正的游戏来说非常理想。

source: This is important as certain games (for example those that use the tilt functions) may not generate events that the OS can interpret as being user input and so shut down the screen or exit the game.
zh_cn: 这一点很重要，因为某些游戏(例如使用倾斜功能的游戏)可能不会生成操作系统可以解释为用户输入的事件，因此会关闭屏幕或退出游戏。

source: This is needed due to the different ways streamed and unstreamed sound playback is handled on the HTML5 target platform, and will return true if the sound can be played and false if it can't.
zh_cn: 这是必要的，因为在HTML5目标平台上处理流式和非流式声音播放的方式不同，如果声音可以播放，将返回true，如果不能播放，将返回false。

source: This is normally set in the Sprite Editor, but there may be moments when you are required to set this manually for a given sprite resource.
zh_cn: 这通常是在精灵编辑器中设置的，但有时可能需要您为给定的精灵资源手动设置。

source: This is not a necessary check to prevent errors as, when a key does not exist, reading from a non-existent key will just return a default value.
zh_cn: 这不是防止错误的必要检查，因为当一个键不存在时，从不存在的键中读取将只返回一个默认值。

source: This is not a necessary check to prevent errors as, when a section does not exist, reading from a non-existent section will just return a default value, however it can be useful to see if an ini file has saved specific data.
zh_cn: 这不是防止错误的必要检查，因为当节不存在时，从不存在的节读取只会返回默认值，但是查看 ini 文件是否保存了特定数据可能很有用。

source: This is not a read only variable, however changing this will not change the index value for the current room, but rather change the room to match the index that you have set the variable to.
zh_cn: 这不是一个只读变量，但是更改它不会更改当前房间的索引值，而是会更改房间以匹配您已设置变量的索引。

source: This is not a read-only variable and can be set as well as read.
zh_cn: 这不是一个只读变量，可以设置和读取。

source: This is not the first key in the order you added them!
zh_cn: 这不是您添加顺序中的第一个键！

source: This is not the last key in the order that you have added them!
zh_cn: 这不是您添加顺序中的最后一个键！

source: This is not the same as the object name, which is a string and can be found using object_get_name(), as this function returns the index number, which is a unique value that GameMaker assigns to every object at the time of creation.
zh_cn: 这与对象名称不同，对象名称是一个字符串，可以使用object_get_name()找到，因为此函数返回索引号，这是GameMaker在创建时分配给每个对象的唯一值。

source: This is only for use in the draw event of an instance (it will not show if used in any other event), and it can also be very useful for clearing surfaces when they are newly created.
zh_cn: 这只用于实例的绘制事件中(如果在任何其他事件中使用，它将不会显示)，而且当新创建的表面被清除时，它也非常有用。

source: This is particularly useful when creating Timelines dynamically using the timeline_add() function, but you should note that if you search for an uninitialised variable (that would otherwise be assigned to a time line's index) an error will be thrown.
zh_cn: 这在使用timeline_add()函数动态创建时间线时特别有用，但是您应该注意，如果您搜索一个未初始化的变量(否则该变量将被分配给时间线的索引),将会抛出一个错误。

source: This is primarily for use with extensions as you can pass this value through to them, allowing them to access the buffer data.
zh_cn: 这主要用于扩展，因为您可以将该值传递给它们，允许它们访问缓冲区数据。

source: This is similar to the round() function, but it only rounds down, no matter what the decimal value, so floor(5.99999) will return 5, as will floor(5.2), floor(5.6457) etc...
zh_cn: 这类似于round()函数，但它只向下舍入，不管十进制值是多少，所以floor(5.99999)将返回5,floor(5.2)、floor(5.6457)等也是如此……

source: This is slightly different to a force in that when it is applied it will immediately affect the speed, and, potentially the torque (or "spin") of the object, particularly if the point chosen to apply the impulse has a vector that is not aligned with the centre of mass (note: the center of mass is not necessarily the same as the origin!).
zh_cn: 这与力略有不同，因为当施加力时，它会立即影响物体的速度，并可能影响物体的扭矩(或"旋转")，特别是如果选择施加冲量的点具有与质心不对齐的矢量(注意:质心不一定与原点相同！

source: This is slightly different to a force in that when it is applied it will immediately affect the speed, and, potentially the torque (or "spin") of the object, particularly if the point chosen to apply the impulse is not aligned with the center of mass (note: the center of mass is not necessarily the same as the origin!).
zh_cn: 这与力略有不同，因为当施加力时，它会立即影响物体的速度，并可能影响物体的扭矩(或"旋转")，特别是如果选择施加冲力的点与质心不对齐(注意:质心不一定与原点相同！

source: This is the "cut-off" threshold at which pixels with alpha will not be drawn.
zh_cn: 这是一个"截止"阈值，带有alpha的像素将绘制时将不会越过。

source: This is the "pure" color tone which is part of the hue, saturation and value (luminosity) method for defining a color.
zh_cn: 这是“纯”色调，它是定义颜色的色调、饱和度和值(亮度)方法的一部分。

source: This is the "pure" colour tone which is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 这是"纯"色调，它是定义颜色的色调、饱和度和值(光度)方法的一部分。

source: This is the amount of the "light" that is mixed into the final color and is part of the hue, saturation and value method for defining a color.
zh_cn: 这是混合到最终颜色中的“光”量，是定义颜色的色调、饱和度和值方法的一部分。

source: This is the amount of the "light" that is mixed into the final colour and is part of the hue, saturation and value method for defining a colour.
zh_cn: 这是混合到最终颜色中的"光"量，是定义颜色的色调、饱和度和值方法的一部分。

source: This is the amount of the color tone that is mixed into the final color and is part of the hue, saturation and value (luminosity) method for defining a color.
zh_cn: 这是混合到最终颜色的颜色色调的数量，是定义颜色的色调、饱和度和值(亮度)方法的一部分。

source: This is the amount of the colour tone that is mixed into the final colour and is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 这是混合到最终颜色的颜色色调的数量，是定义颜色的色调、饱和度和值(光度)方法的一部分。

source: This is the default C, C++ call
zh_cn: 这是默认的 C, C++ 调用

source: This is the distance from the listener the emitter has to be before the sound will have "fallen off" to a volume of 0.
zh_cn: 这是声音"衰减"到音量为0之前，发射器与侦听器之间的距离。

source: This is the function power(e,n), where e is approximately 2.718281828 (also known as Euler's Number), and n is the number of times it should be multiplied by itself.
zh_cn: 这是函数的幂(e,n)，其中e约为2.718281828(也称为欧拉数)，n是它自身相乘的次数。

source: This is the function that governs how long each individual particle of the indicated type remains on the screen.
zh_cn: 这是控制指定类型的每个粒子在屏幕上停留多长时间的函数。

source: This is the key that is to be mapped
zh_cn: 这是要映射的键

source: This is the key that key1 is to be mapped to
zh_cn: 这是key1要映射到的键

source: This is the key that you wish to get the mapped value from
zh_cn: 这是您希望从中获取映射值的键

source: This is the multiplier value used to slow down or speed up the playback speed.
zh_cn: 这是用于减慢或加快播放速度的乘数值。

source: This is the name of the sequence as a string and you can get or set this value as required.
zh_cn: 这是字符串形式的序列名称，您可以根据需要获取或设置该值。

source: This is the number of frames that the sequence will run for.
zh_cn: 这是序列将运行的帧数。

source: This is the only effective way to manage video memory when you have multiple texture pages for a game, and you should flush the texture memory between levels on your game and organise the graphics using the texture group feature to ensure that the minimum number of textures are used.
zh_cn: 当你的游戏拥有多个纹理页面时，这是管理视频内存的唯一有效方法，你应该在游戏关卡间刷新纹理内存，并使用纹理组功能组织图像，以确保使用的纹理数量最少。

source: This is the origin of the sequence along the X axis.
zh_cn: 这是X轴上序列的原点。

source: This is the origin of the sequence along the Y axis.
zh_cn: 这是Y轴上序列的原点。

source: This is the oscillation frequency for the joint, in hertz
zh_cn: 这是关节的振荡频率，单位为赫兹

source: This is the playback mode of the sequence object and can be get or set.
zh_cn: 这是序列对象的回放模式，可以获取或设置。

source: This is the point at which the sprite will be "attached" or "drawn" when used with an instance.
zh_cn: 这是精灵与实例一起使用时将被"附加"或"绘制"的点。

source: This is the position of the instance within the physics world in the previous step to the current one
zh_cn: 这是物理世界中实例在当前步骤之前的位置

source: This is the position of the instance within the physics world in the previous step to the current one.
zh_cn: 这是上一步到当前步的物理世界中实例的位置。

source: This is the reaction force being applied to the second instance in a joint at the x anchor position
zh_cn: 这是在关节x锚点处施加到第二个实例上的反作用力

source: This is the reaction force being applied to the second instance in a joint at the y anchor position
zh_cn: 这是在y锚位置的关节上施加到第二个实例上的反作用力

source: This is the speed at which the motor should move
zh_cn: 这是马达应该移动的速度

source: This is the speed at which the motor should rotate
zh_cn: 这是马达应该旋转的速度

source: This is the standard WinAPI call (Windows dll only)
zh_cn: 这是标准的WinAPI调用(仅限Windows dll)

source: This is the target area to open the URL in (see description).
zh_cn: 这是打开URL的目标区域(参见描述)。

source: This is the target area to open the URL in.
zh_cn: 这是打开URL的目标。

source: This is the torque being applied to the second instance in a joint at the anchor position
zh_cn: 这是在锚固位置的关节中应用到第二个实例的扭矩

source: This is the user id in Opera GX in the rollback networking system.
zh_cn: 这是回滚网络系统中Opera GX的用户id。

source: This is very useful as it gives you the ability to delete joints or change an instances behaviour depending on whatever your needs are at the time.
zh_cn: 这非常有用，因为它使您能够根据您当时的需求删除关节或更改实例的行为。

source: This last part means that it either starts and follows the path exactly as you designed and placed it in the Path Editor (absolute), or it starts and follows the path from the position at which the instance was created (relative).
zh_cn: 这最后一部分意味着它要么完全按照您在路径编辑器中设计和放置的路径开始并跟随路径(absolute绝对)，要么从创建实例的位置开始并跟随路径(relative相对)。

source: This mask will over-ride the default mask or that which you may have set using the function audio_set_listener_mask().
zh_cn: 该掩码将覆盖默认掩码或您使用函数audio_set_listener_mask()设置的掩码。

source: This may include the instance running the code if the "notme" flag is set to false, but normally you would want that instance to be active, in which case the "notme" flag should be set to true.
zh_cn: 如果"notme"标志设置为false，这可能包括运行代码的实例，但通常情况下，您希望该实例是活动的，在这种情况下，"notme"标志应该设置为true。

source: This may not always be what you want and so to turn the radians into degrees we use this function.
zh_cn: 这可能不总是你想要的，所以我们用此函数把弧度转换成度数。

source: This means that a left position of 0 and a top position of 0 would be the top left corner of the sprite and all further coordinates should be taken from that position.
zh_cn: 这意味着左边的位置为0，顶部的位置为0将是精灵的左上角，所有进一步的坐标都应该从该位置获得。

source: This means that a left position of 0 and a top position of 0 would be the top left corner of the surface and all further coordinates should be taken from that position.
zh_cn: 这意味着0的左侧位置和0的顶部位置将是表面的左上角，并且所有进一步的坐标将从该位置获取。

source: This means that all instances of this object that are created after solid has been changed will be created with this new state, while instances that are already in the room may not be affected.
zh_cn: 这意味着在solid被更改后创建的该对象的所有实例都将以这种新状态创建，而已经在房间中的实例可能不会受到影响。

source: This means that all instances of this object that are created after the mask has been changed will be created with this new mask, while instances that are already in the room may not be affected.
zh_cn: 这意味着在掩码被更改之后创建的该对象的所有实例都将使用这个新掩码创建，而已经在房间中的实例可能不会受到影响。

source: This means that all instances of this object that are created after the sprite_index has been changed will be created with this new sprite_index, while instances that are already in the room may not be affected.
zh_cn: 这意味着在sprite_index被更改之后创建的该对象的所有实例都将使用这个新的sprite_index创建，而已经在房间中的实例可能不会受到影响。

source: This means that all instances of this object that are created after visible has been changed will be created with this new state, while instances that are already in the room may not be affected.
zh_cn: 这意味着在更改了visible之后创建的该对象的所有实例都将以这种新状态创建，而已经在房间中的实例可能不会受到影响。

source: This means that anisotropic filtering is enabled, which greatly improves texture transition quality and can reduce the blurring visible with other filtering modes, but it has the highest hit on performance.
zh_cn: 这意味着启用了各向异性过滤，这大大提高了纹理过渡质量，并可以减少其他过滤模式下可见的模糊，但它对性能的影响最大。

source: This means that blending between mipmap levels is disabled, which can cause visible texture transitions, but gives the best performance.
zh_cn: 这意味着禁用mipmap级别之间的混合，这可能会导致可见的纹理过渡，但会提供最佳性能。

source: This means that blending between mipmap levels is enabled (this is also known as trilinear filtering), which smooths the texture transitions, but it will give a minor hit to performance.
zh_cn: 这意味着启用了mipmap贴图级别之间的混合(也称为三线性过滤)，这可以平滑纹理过渡，但会对性能造成轻微影响。

source: This means that checks for it being held down will not return true until the player releases the button and presses it again (but the release state will still be detected if the clear is done while the mouse button is being held down).
zh_cn: 这意味着对它被按住的检查将不会返回true，直到玩家释放按钮并再次按下它(但是如果清除是在鼠标按钮被按住时完成的，释放状态仍然会被检测到)。

source: This means that everything that is shown in the chosen view port will now be drawn to the assigned surface and the contents of that view port will no longer be displayed, meaning that you will need to either:
zh_cn: 这意味着在选择的视图端口中显示的所有内容现在将被绘制到指定的表面，该视图端口的内容将不再显示，这意味着你将需要:

source: This means that everything that is shown in the chosen view will now be drawn to the assigned surface.
zh_cn: 这意味着在所选视图中显示的所有内容都将被绘制到指定的表面上。

source: This means that if you have used any of the Instance Deactivate functions those instances that have been deactivated will not be included in this array (if you have used a value from this array previously, it will now return the keyword noone).
zh_cn: 这意味着，如果您使用了任何实例取消激活函数，那么已经取消激活的实例将不会包含在该数组中(如果您以前使用了该数组中的值，那么它现在将返回关键字noone)。

source: This means that it will also trigger an Asynchronous Load/Save Event to inform you that the whole group has been loaded into memory and the sounds can now be used.
zh_cn: 这意味着它还将触发一个异步加载/保存事件，以通知您整个组已经加载到内存中，现在可以使用声音了。

source: This means that its properties are transferred to the selected instance, not the actual fixture itself, so that one fixture can be bound to multiple instances if all are to have the same properties.
zh_cn: 这意味着它的属性被传递到选定的实例，而不是实际的夹具本身，这样，如果所有实例都具有相同的属性，一个夹具可以绑定到多个实例。

source: This means that once you have assigned an area to a virtual key, all touches on that area will trigger the keyboard event corresponding to the key you have mapped to the area.
zh_cn: 这意味着，一旦您将一个区域分配给一个虚拟键，该区域上的所有触摸都将触发与您映射到该区域的键相对应的键盘事件。

source: This means that the results will depend on the event in which the function is called, and also on the target surface being used.
zh_cn: 这意味着结果将取决于调用此函数的事件，也取决于正在使用的目标表面。

source: This means that we will only proceed past the current frame if all inputs are confirmed.
zh_cn: 这意味着，只有在所有输入都得到确认的情况下，我们才会继续越过当前帧。

source: This means that you also need to free this memory when the DS map is not needed to prevent errors, memory leaks and loss of performance when running your game.
zh_cn: 这意味着当DS map不需要时，你也需要释放这个内存，以防止错误，内存泄漏和运行游戏时的性能损失。

source: This means that you can get a "vibrating" instance as it moves (for example) 3 pixels forward, overshoots the x/y target position by 2, then moves 3 pixels back again, overshooting the target point by one and so on...
zh_cn: 这意味着，当它向前移动(例如)3个像素，超出x/y目标位置2个像素，然后再次向后移动3个像素，超出目标点1个像素等等时，您可以获得一个"振动"实例...

source: This means that you can tell instances with that fixture to always collide or never collide with other instance that have fixtures bound to them with the same collision group.
zh_cn: 这意味着您可以告诉带有该夹具的实例总是与其他具有相同碰撞组的夹具绑定到它们的实例碰撞或永不碰撞。

source: This means that you could have a room speed of 30, but set the physics to 60, effectively doubling the speed at which the physics system updates and performs its calculations compared to the speed at which the step are updated.
zh_cn: 这意味着您可以将房间速度设置为30，但将物理设置为60，与步骤更新的速度相比，物理系统更新和执行计算的速度实际上是两倍。

source: This means that you do not have to manually go through the list contents and destroy the marked data structures individually before destroying the "parent" list.
zh_cn: 这意味着在销毁"父"列表之前，您不必手动检查列表内容并单独销毁标记的数据结构。

source: This means that you must create two completely new sprites "on the fly" in some way for the function to work correctly.
zh_cn: 这意味着你必须以某种方式"动态地"创建两个全新的精灵，才能让函数正确工作。

source: This means that you will want to keep the number of characters that you use to a minimum and specify only the range of characters that your game will need so as to keep texture memory as optimised as possible.
zh_cn: 这意味着你将希望保持你所使用的字符数量最少，并且只指定你的游戏所需要的字符范围，以便尽可能的优化纹理内存。

source: This means that, for example, median(43, 12, 25, 19, 6) would return 19 as it is the middle value between all the rest.
zh_cn: 这意味着，例如，median(43, 12, 25, 19, 6)将返回19，因为它是所有其他值的中间值。

source: This model will be used for all the audio functions in the game or app, and so you should make sure that the model you choose is the correct one, as each one will affect how the listener perceives the sounds you play through emitters or with the function audio_play_sound_at.
zh_cn: 这个模型将用于游戏或应用中的所有音频功能，所以你应该确保你选择的模型是正确的，因为每个模型都会影响听者如何通过发射器或函数audio_play_sound_at来感知你播放的声音。

source: This name is the one that has been specified for the object in the Asset Browser of the main GameMaker window.
zh_cn: 这个名称是在主GameMaker窗口的资源浏览器中为对象指定的名称。

source: This name is the one that has been specified for the script in the Asset Browser of the main GameMaker window.
zh_cn: 这个名称是在主GameMaker窗口的资源浏览器中为脚本指定的名称。

source: This name is the one that has been specified for the sprite in the resource tree of the main GameMaker window.
zh_cn: 该名称是在GameMaker主窗口的资源树中为精灵指定的名称。

source: This name is the one that has been specified for the tile set in the Asset Browser of the main GameMaker window.
zh_cn: 该名称是在GameMaker主窗口的资源浏览器中为图块集指定的名称。

source: This needn't be a defining point of the path, it can be anywhere on it.
zh_cn: 这不必是路径的一个定义点，它可以在路径上的任何地方。

source: This number is used to prevent an infinite loop.
zh_cn: 这个数字用于防止无限循环。
